Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Конфигурации/Конфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конфигурации</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>КаталогКонфигурации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаЗапускаПлатформы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВОтчетность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключенияБезПривязки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаКонфигурацию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьОбъектыСПрефиксомУдалить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьОшибкиВСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучатьОтветственныхЗаМетаданныеИзСППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппироватьОшибкиПоОтветственному</name>
    <type>
      <types>EnumRef.ВидыГруппировокСППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКонфигурацииСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияКонфигурацииСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеКТекстуОшибкиСППР</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Расписание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПроверки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АктивностьРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиВручную</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверкиПоРасписанию</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоБиблиотека</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнятьРассылкуРезультатовПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОсобенностиПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлуВыгрузкиОсобенностей</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеВыгрузкиОсобенностей</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательВыгрузкиОсобенностей</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыгрузкиОсобенностей</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширеннаяПроверкаПоДополнительнымТребованиям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьАвтораОсобенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сценарий</name>
    <comment>0 - Конфигурация, 1 - Расширения, 2 - Конфигурация и расширения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИС_ИспользоватьКаталогФайловXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС_КаталогФайловXML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИС_GUID</name>
    <comment>ИнфоСофт, Фоминых В.С., 23.09.2018</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсключенияИзПроверки</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсключения</name>
      <type>
        <types>EnumRef.ВидыИсключенийИзПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.Расширения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Библиотеки</name>
    <attributes>
      <name>БиблиотечнаяКонфигурация</name>
      <type>
        <types>CatalogRef.Конфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПричиныОсобенностей</name>
    <attributes>
      <name>ПричинаОсобенности</name>
      <type>
        <types>CatalogRef.ПричиныОсобенности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расписания</name>
    <attributes>
      <name>АктивностьРасписания</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроверкиПоРасписанию</name>
      <type>
        <types>CatalogRef.ВариантыПроверки</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроверкиПоРасписаниюСтрокой</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяЗапуска</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПользовательПроверки</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Расписание</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>РегистрироватьВсеОшибкиКакОсобенностиПоРасписанию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонПисьма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>Расширение</name>
      <type>
        <types>CatalogRef.Расширения</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/НайденныеОшибки/НайденныеОшибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НайденныеОшибки</name>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.ОбнаруживаемыеОшибки</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеОшибки</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>АвторОсобенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПомещенияВОсобенности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>МестоОбнаружения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОсобенности</name>
    <type>
      <types>CatalogRef.ПричиныОсобенности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИдентификаторОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.Правила</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/КомментарииНайденныхОшибок/КомментарииНайденныхОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииНайденныхОшибок</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураКонфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/СтруктураКонфигурации/СтруктураКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураКонфигурации</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Версии</owners>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоПорядку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Путь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобраныСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВходитВПодсистемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВходитВПодсистемыПуть</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Видимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЭтоПодсистема</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>CatalogRef.Расширения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подсистемы</name>
    <attributes>
      <name>Подсистема</name>
      <type>
        <types>CatalogRef.СтруктураКонфигурации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Конфигурации/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ЭтоКопия Экспорт;    // Флаг копирования объекта.
Перем ОбъектКопия Экспорт; // Содержит ссылку на источник копирования.

#КонецОбласти

#Область ОбработчикиСобытий

// Обработчик ПередЗаписью
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЭтоКопия = Истина;
	ОбъектКопия = ОбъектКопирования.Ссылка;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоКопия Тогда
		СкопироватьКонфигурацию(ОбъектКопия, Ссылка);
		ЭтоКопия = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СкопироватьКонфигурацию(Источник, Приемник)
	
	ВерсияИсточник = НайтиПоследнююВерсию(Источник, Ложь);
	Если ЗначениеЗаполнено(ВерсияИсточник) Тогда
		ВерсияПриемник = СкопироватьВерсиюКонфигурации(Источник, Приемник, ВерсияИсточник);
		СкопироватьСтруктуруКонфигурации(ВерсияИсточник, ВерсияПриемник);
		ТаблицаНомеровОшибок = СкопироватьОшибкиКонфигурации(ВерсияИсточник, ВерсияПриемник);
		СкопироватьКомментарииНайденныхОшибок(ТаблицаНомеровОшибок);
	Иначе
		Сообщить(НСтр("ru='Не найдено ни одной версии конфигурации-источника.'") + " "
			+ НСтр("ru='Версия и структура конфигурации не будут скопированы.'"));
	КонецЕсли;
	
КонецПроцедуры

Функция СкопироватьОшибкиКонфигурации(ВерсияИсточник, ВерсияПриемник)
	
	ТаблицаНомеровОшибок = Новый ТаблицаЗначений;
	ТаблицаНомеровОшибок.Колонки.Добавить("СтарыйНомер", Новый ОписаниеТипов("Число"));
	ТаблицаНомеровОшибок.Колонки.Добавить("НовыйНомер", Новый ОписаниеТипов("Число"));
	ТаблицаНомеровОшибок.Колонки.Добавить("Объект", Новый ОписаниеТипов("СправочникСсылка.СтруктураКонфигурации"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НайденныеОшибки.Правило,
	|	НайденныеОшибки.Номер КАК Номер,
	|	НайденныеОшибки.Ошибка,
	|	НайденныеОшибки.Состояние,
	|	НайденныеОшибки.Ответственный,
	|	НайденныеОшибки.АвторОсобенности,
	|	НайденныеОшибки.ДатаПомещенияВОсобенности,
	|	НайденныеОшибки.МестоОбнаружения,
	|	НайденныеОшибки.Уточнение,
	|	НайденныеОшибки.ДатаМодификации,
	|	НайденныеОшибки.ПричинаОсобенности,
	|	ЕСТЬNULL(СтруктураКонфигурации.Ссылка, &ПустаяСсылка) КАК Объект
	|ИЗ
	|	РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктураКонфигурации КАК СтруктураКонфигурации
	|		ПО (НайденныеОшибки.Объект.Путь = СтруктураКонфигурации.Путь)
	|		 И (НайденныеОшибки.Объект.ТипОбъекта = СтруктураКонфигурации.ТипОбъекта)
	|		 И (СтруктураКонфигурации.Владелец = &ВерсияПриемник)
	|ГДЕ
	|	НайденныеОшибки.Объект.Владелец = &ВерсияИсточник
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект, Номер";
	
	Запрос.УстановитьПараметр("ВерсияИсточник", ВерсияИсточник);
	Запрос.УстановитьПараметр("ВерсияПриемник", ВерсияПриемник);
	Запрос.УстановитьПараметр("ПустаяСсылка", Справочники.СтруктураКонфигурации.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПоследнийНомерОшибки = ПолучитьМаксимальныйНомерОшибки();
	
	НайденныеОшибкиНаборЗаписей = РегистрыСведений.НайденныеОшибки.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		ПоследнийНомерОшибки = ПоследнийНомерОшибки + 1;
		
		СтрокаТаблицы = ТаблицаНомеровОшибок.Добавить();
		СтрокаТаблицы.СтарыйНомер = Выборка.Номер;
		СтрокаТаблицы.НовыйНомер = ПоследнийНомерОшибки;
		СтрокаТаблицы.Объект = Выборка.Объект;
		
		НайденныеОшибкиНаборЗаписей.Отбор.Объект.Значение = Выборка.Объект;
		НайденныеОшибкиНаборЗаписей.Отбор.Объект.Использование = Истина;
		НайденныеОшибкиНаборЗаписей.Прочитать();
		
		НоваяЗапись = НайденныеОшибкиНаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Номер = ПоследнийНомерОшибки;
		
		НайденныеОшибкиНаборЗаписей.Записать();
		
	КонецЦикла;
	
	Возврат ТаблицаНомеровОшибок;
	
КонецФункции

Функция СкопироватьКомментарииНайденныхОшибок(ТаблицаНомеровОшибок)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТаблицаНомеровОшибок", ТаблицаНомеровОшибок);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаНомеровОшибок.Объект,
	|	ТаблицаНомеровОшибок.СтарыйНомер,
	|	ТаблицаНомеровОшибок.НовыйНомер
	|ПОМЕСТИТЬ ТаблицаНомеров
	|ИЗ
	|	&ТаблицаНомеровОшибок КАК ТаблицаНомеровОшибок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КомментарииНайденныхОшибок.Комментарий,
	|	ТаблицаНомеров.Объект КАК Объект,
	|	ТаблицаНомеров.НовыйНомер КАК Номер
	|ИЗ
	|	ТаблицаНомеров КАК ТаблицаНомеров
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КомментарииНайденныхОшибок КАК КомментарииНайденныхОшибок
	|		ПО ТаблицаНомеров.СтарыйНомер = КомментарииНайденныхОшибок.Номер
	|
	|УПОРЯДОЧИТЬ ПО
	|	Объект, Номер";
	
	ТаблицаКомментарииНайденныхОшибок = Запрос.Выполнить().Выгрузить();
	
	КомментарииНайденныхОшибокНаборЗаписей = РегистрыСведений.КомментарииНайденныхОшибок.СоздатьНаборЗаписей();
	
	Для Каждого КомментарийНайденныхОшибок Из ТаблицаКомментарииНайденныхОшибок Цикл
		
		КомментарииНайденныхОшибокНаборЗаписей.Отбор.Объект.Установить(КомментарийНайденныхОшибок.Объект);
		КомментарииНайденныхОшибокНаборЗаписей.Прочитать();
		
		НоваяЗапись = КомментарииНайденныхОшибокНаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, КомментарийНайденныхОшибок);
		
		КомментарииНайденныхОшибокНаборЗаписей.Записать();
		
	КонецЦикла;
	
КонецФункции

Функция СкопироватьВерсиюКонфигурации(Источник, Приемник, ВерсияИсточник)
	
	МассивСвойствДляИсключения = Новый Массив;
	МассивСвойствДляИсключения.Добавить("Владелец");
	МассивСвойствДляИсключения.Добавить("Родитель");
	МассивСвойствДляИсключения.Добавить("СобранныеДанные");
	
	СвойстваДляИсключения = СтрСоединить(МассивСвойствДляИсключения, ", ");
	
	НовыйЭлемент = Справочники.Версии.СоздатьЭлемент();
	НовыйЭлемент.Владелец = Приемник;
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, ВерсияИсточник,, СвойстваДляИсключения);
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка;
	
КонецФункции

Процедура СкопироватьПодсистемыОбъекта(ОбъектИсточник, ОбъектПриемник)
	
	Для Каждого ПодсистемаИсточник Из ОбъектИсточник.Подсистемы Цикл
		
		ПодсистемаПуть = ПодсистемаИсточник.Подсистема.Путь;
		ВерсияПриемник = ОбъектПриемник.Владелец;
		ПодсистемаСсылка = Справочники.СтруктураКонфигурации.НайтиПоРеквизиту("Путь", ПодсистемаПуть,, ВерсияПриемник);
		
		ПодсистемаПриемник = ОбъектПриемник.Подсистемы.Добавить();
		ПодсистемаПриемник.Подсистема = ПодсистемаСсылка;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкопироватьСтруктуруКонфигурации(ВерсияИсточник, ВерсияПриемник)
	
	ЗапросПоОбъектам = Новый Запрос;
	ЗапросПоОбъектам.Текст = "
	|ВЫБРАТЬ
	|	СтруктураКонфигурации.Ссылка
	|ИЗ
	|	Справочник.СтруктураКонфигурации КАК СтруктураКонфигурации
	|ГДЕ
	|	СтруктураКонфигурации.Владелец = &Владелец
	|	И НЕ СтруктураКонфигурации.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктураКонфигурации.НомерПоПорядку";
		
	ЗапросПоОбъектам.УстановитьПараметр("Владелец", ВерсияИсточник);
	
	Выборка = ЗапросПоОбъектам.Выполнить().Выбрать();
	НомерОбъекта = 0;
	ВсегоОбъектов = Выборка.Количество();
	Пока Выборка.Следующий() Цикл
		
		СсылкаИсточник = Выборка.Ссылка;
		ОбъектПриемник = Справочники.СтруктураКонфигурации.СоздатьЭлемент();
		
		ЗаполнитьЗначенияСвойств(ОбъектПриемник, СсылкаИсточник,, "Владелец, Родитель, Код");
		
		РодительПуть = Выборка.Ссылка.Родитель.Путь;
		РодительСсылка = Справочники.СтруктураКонфигурации.НайтиПоРеквизиту("Путь", РодительПуть,, ВерсияПриемник);
		ОбъектПриемник.Родитель = РодительСсылка;
		ОбъектПриемник.Владелец = ВерсияПриемник;
		
		СкопироватьПодсистемыОбъекта(СсылкаИсточник, ОбъектПриемник);
		
		ЭлементЗаписан = Ложь;
		СчетчикТранзакций = 1;
		
		Пока (НЕ ЭлементЗаписан) И (СчетчикТранзакций < 1000) Цикл
			ЭлементЗаписан = Истина;
			Попытка
				ОбъектПриемник.Записать();
			Исключение
				ЭлементЗаписан = Ложь;
			КонецПопытки;
			СчетчикТранзакций = СчетчикТранзакций + 1;
		КонецЦикла;
		
		НомерОбъекта = НомерОбъекта + 1;
		#Если Клиент Тогда
		ТекстСостояния = НСтр("ru='Выполняется запись структуры конфигурации.'") + " "
			+ СтрШаблон(НСтр("ru='Объект конфигурации №%1 из %2: %3.'"), НомерОбъекта, ВсегоОбъектов, ОбъектПриемник.Путь);
		Состояние(ТекстСостояния);
		#КонецЕсли
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

ЭтоКопия = Ложь;

#КонецОбласти

#КонецЕсли
